foxval/esp-idf/components/soc/esp32c/include/soc/slc_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_SLC_REG_H_
#define _SOC_SLC_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"
#define SLC_CONF0_REG          (DR_REG_SLC_BASE + 0x0)
/* SLC_SLC0_WR_RETRY_MASK_EN : R/W ;bitpos:[18] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_WR_RETRY_MASK_EN  (BIT(18))
#define SLC_SLC0_WR_RETRY_MASK_EN_M  (BIT(18))
#define SLC_SLC0_WR_RETRY_MASK_EN_V  0x1
#define SLC_SLC0_WR_RETRY_MASK_EN_S  18
/* SLC_SLC0_TOKEN_SEL : R/W ;bitpos:[15] ;default: 1'h1 ; */
/*description: */
#define SLC_SLC0_TOKEN_SEL  (BIT(15))
#define SLC_SLC0_TOKEN_SEL_M  (BIT(15))
#define SLC_SLC0_TOKEN_SEL_V  0x1
#define SLC_SLC0_TOKEN_SEL_S  15
/* SLC_SLC0_TOKEN_AUTO_CLR : R/W ;bitpos:[14] ;default: 1'h1 ; */
/*description: */
#define SLC_SLC0_TOKEN_AUTO_CLR  (BIT(14))
#define SLC_SLC0_TOKEN_AUTO_CLR_M  (BIT(14))
#define SLC_SLC0_TOKEN_AUTO_CLR_V  0x1
#define SLC_SLC0_TOKEN_AUTO_CLR_S  14
/* SLC_SLC0_TXDATA_BURST_EN : R/W ;bitpos:[13] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_TXDATA_BURST_EN  (BIT(13))
#define SLC_SLC0_TXDATA_BURST_EN_M  (BIT(13))
#define SLC_SLC0_TXDATA_BURST_EN_V  0x1
#define SLC_SLC0_TXDATA_BURST_EN_S  13
/* SLC_SLC0_TXDSCR_BURST_EN : R/W ;bitpos:[12] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_TXDSCR_BURST_EN  (BIT(12))
#define SLC_SLC0_TXDSCR_BURST_EN_M  (BIT(12))
#define SLC_SLC0_TXDSCR_BURST_EN_V  0x1
#define SLC_SLC0_TXDSCR_BURST_EN_S  12
/* SLC_SLC0_TXLINK_AUTO_RET : R/W ;bitpos:[11] ;default: 1'h1 ; */
/*description: */
#define SLC_SLC0_TXLINK_AUTO_RET  (BIT(11))
#define SLC_SLC0_TXLINK_AUTO_RET_M  (BIT(11))
#define SLC_SLC0_TXLINK_AUTO_RET_V  0x1
#define SLC_SLC0_TXLINK_AUTO_RET_S  11
/* SLC_SLC0_RXLINK_AUTO_RET : R/W ;bitpos:[10] ;default: 1'h1 ; */
/*description: */
#define SLC_SLC0_RXLINK_AUTO_RET  (BIT(10))
#define SLC_SLC0_RXLINK_AUTO_RET_M  (BIT(10))
#define SLC_SLC0_RXLINK_AUTO_RET_V  0x1
#define SLC_SLC0_RXLINK_AUTO_RET_S  10
/* SLC_SLC0_RXDATA_BURST_EN : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_RXDATA_BURST_EN  (BIT(9))
#define SLC_SLC0_RXDATA_BURST_EN_M  (BIT(9))
#define SLC_SLC0_RXDATA_BURST_EN_V  0x1
#define SLC_SLC0_RXDATA_BURST_EN_S  9
/* SLC_SLC0_RXDSCR_BURST_EN : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_RXDSCR_BURST_EN  (BIT(8))
#define SLC_SLC0_RXDSCR_BURST_EN_M  (BIT(8))
#define SLC_SLC0_RXDSCR_BURST_EN_V  0x1
#define SLC_SLC0_RXDSCR_BURST_EN_S  8
/* SLC_SLC0_RX_NO_RESTART_CLR : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_NO_RESTART_CLR  (BIT(7))
#define SLC_SLC0_RX_NO_RESTART_CLR_M  (BIT(7))
#define SLC_SLC0_RX_NO_RESTART_CLR_V  0x1
#define SLC_SLC0_RX_NO_RESTART_CLR_S  7
/* SLC_SLC0_RX_AUTO_WRBACK : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_AUTO_WRBACK  (BIT(6))
#define SLC_SLC0_RX_AUTO_WRBACK_M  (BIT(6))
#define SLC_SLC0_RX_AUTO_WRBACK_V  0x1
#define SLC_SLC0_RX_AUTO_WRBACK_S  6
/* SLC_SLC0_RX_LOOP_TEST : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_RX_LOOP_TEST  (BIT(5))
#define SLC_SLC0_RX_LOOP_TEST_M  (BIT(5))
#define SLC_SLC0_RX_LOOP_TEST_V  0x1
#define SLC_SLC0_RX_LOOP_TEST_S  5
/* SLC_SLC0_TX_LOOP_TEST : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_TX_LOOP_TEST  (BIT(4))
#define SLC_SLC0_TX_LOOP_TEST_M  (BIT(4))
#define SLC_SLC0_TX_LOOP_TEST_V  0x1
#define SLC_SLC0_TX_LOOP_TEST_S  4
/* SLC_AHBM_RST : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SLC_AHBM_RST  (BIT(3))
#define SLC_AHBM_RST_M  (BIT(3))
#define SLC_AHBM_RST_V  0x1
#define SLC_AHBM_RST_S  3
/* SLC_AHBM_FIFO_RST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_AHBM_FIFO_RST  (BIT(2))
#define SLC_AHBM_FIFO_RST_M  (BIT(2))
#define SLC_AHBM_FIFO_RST_V  0x1
#define SLC_AHBM_FIFO_RST_S  2
/* SLC_SLC0_RX_RST : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_RST  (BIT(1))
#define SLC_SLC0_RX_RST_M  (BIT(1))
#define SLC_SLC0_RX_RST_V  0x1
#define SLC_SLC0_RX_RST_S  1
/* SLC_SLC0_TX_RST : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC0_TX_RST  (BIT(0))
#define SLC_SLC0_TX_RST_M  (BIT(0))
#define SLC_SLC0_TX_RST_V  0x1
#define SLC_SLC0_TX_RST_S  0

#define SLC_0INT_RAW_REG          (DR_REG_SLC_BASE + 0x4)
/* SLC_SLC0_HOST_POP_EOF_ERR_INT_RAW : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_RAW  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_RAW_M  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_RAW_V  0x1
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_RAW_S  27
/* SLC_SLC0_RX_QUICK_EOF_INT_RAW : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_QUICK_EOF_INT_RAW  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_RAW_M  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_RAW_V  0x1
#define SLC_SLC0_RX_QUICK_EOF_INT_RAW_S  26
/* SLC_CMD_DTC_INT_RAW : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define SLC_CMD_DTC_INT_RAW  (BIT(25))
#define SLC_CMD_DTC_INT_RAW_M  (BIT(25))
#define SLC_CMD_DTC_INT_RAW_V  0x1
#define SLC_CMD_DTC_INT_RAW_S  25
/* SLC_SLC0_TX_ERR_EOF_INT_RAW : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_ERR_EOF_INT_RAW  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_RAW_M  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_RAW_V  0x1
#define SLC_SLC0_TX_ERR_EOF_INT_RAW_S  24
/* SLC_SLC0_WR_RETRY_DONE_INT_RAW : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_WR_RETRY_DONE_INT_RAW  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_RAW_M  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_RAW_V  0x1
#define SLC_SLC0_WR_RETRY_DONE_INT_RAW_S  23
/* SLC_SLC0_HOST_RD_ACK_INT_RAW : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_HOST_RD_ACK_INT_RAW  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_RAW_M  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_RAW_V  0x1
#define SLC_SLC0_HOST_RD_ACK_INT_RAW_S  22
/* SLC_SLC0_TX_DSCR_EMPTY_INT_RAW : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DSCR_EMPTY_INT_RAW  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_RAW_M  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_RAW_V  0x1
#define SLC_SLC0_TX_DSCR_EMPTY_INT_RAW_S  21
/* SLC_SLC0_RX_DSCR_ERR_INT_RAW : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_DSCR_ERR_INT_RAW  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_RAW_M  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_RAW_V  0x1
#define SLC_SLC0_RX_DSCR_ERR_INT_RAW_S  20
/* SLC_SLC0_TX_DSCR_ERR_INT_RAW : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DSCR_ERR_INT_RAW  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_RAW_M  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_RAW_V  0x1
#define SLC_SLC0_TX_DSCR_ERR_INT_RAW_S  19
/* SLC_SLC0_TOHOST_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOHOST_INT_RAW  (BIT(18))
#define SLC_SLC0_TOHOST_INT_RAW_M  (BIT(18))
#define SLC_SLC0_TOHOST_INT_RAW_V  0x1
#define SLC_SLC0_TOHOST_INT_RAW_S  18
/* SLC_SLC0_RX_EOF_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_EOF_INT_RAW  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_RAW_M  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_RAW_V  0x1
#define SLC_SLC0_RX_EOF_INT_RAW_S  17
/* SLC_SLC0_RX_DONE_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_DONE_INT_RAW  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_RAW_M  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_RAW_V  0x1
#define SLC_SLC0_RX_DONE_INT_RAW_S  16
/* SLC_SLC0_TX_SUC_EOF_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_SUC_EOF_INT_RAW  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_RAW_M  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_RAW_V  0x1
#define SLC_SLC0_TX_SUC_EOF_INT_RAW_S  15
/* SLC_SLC0_TX_DONE_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DONE_INT_RAW  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_RAW_M  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_RAW_V  0x1
#define SLC_SLC0_TX_DONE_INT_RAW_S  14
/* SLC_SLC0_TOKEN1_1TO0_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN1_1TO0_INT_RAW  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_RAW_M  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_RAW_V  0x1
#define SLC_SLC0_TOKEN1_1TO0_INT_RAW_S  13
/* SLC_SLC0_TOKEN0_1TO0_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN0_1TO0_INT_RAW  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_RAW_M  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_RAW_V  0x1
#define SLC_SLC0_TOKEN0_1TO0_INT_RAW_S  12
/* SLC_SLC0_TX_OVF_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_OVF_INT_RAW  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_RAW_M  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_RAW_V  0x1
#define SLC_SLC0_TX_OVF_INT_RAW_S  11
/* SLC_SLC0_RX_UDF_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_UDF_INT_RAW  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_RAW_M  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_RAW_V  0x1
#define SLC_SLC0_RX_UDF_INT_RAW_S  10
/* SLC_SLC0_TX_START_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_START_INT_RAW  (BIT(9))
#define SLC_SLC0_TX_START_INT_RAW_M  (BIT(9))
#define SLC_SLC0_TX_START_INT_RAW_V  0x1
#define SLC_SLC0_TX_START_INT_RAW_S  9
/* SLC_SLC0_RX_START_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_START_INT_RAW  (BIT(8))
#define SLC_SLC0_RX_START_INT_RAW_M  (BIT(8))
#define SLC_SLC0_RX_START_INT_RAW_V  0x1
#define SLC_SLC0_RX_START_INT_RAW_S  8
/* SLC_FRHOST_BIT7_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT7_INT_RAW  (BIT(7))
#define SLC_FRHOST_BIT7_INT_RAW_M  (BIT(7))
#define SLC_FRHOST_BIT7_INT_RAW_V  0x1
#define SLC_FRHOST_BIT7_INT_RAW_S  7
/* SLC_FRHOST_BIT6_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT6_INT_RAW  (BIT(6))
#define SLC_FRHOST_BIT6_INT_RAW_M  (BIT(6))
#define SLC_FRHOST_BIT6_INT_RAW_V  0x1
#define SLC_FRHOST_BIT6_INT_RAW_S  6
/* SLC_FRHOST_BIT5_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT5_INT_RAW  (BIT(5))
#define SLC_FRHOST_BIT5_INT_RAW_M  (BIT(5))
#define SLC_FRHOST_BIT5_INT_RAW_V  0x1
#define SLC_FRHOST_BIT5_INT_RAW_S  5
/* SLC_FRHOST_BIT4_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT4_INT_RAW  (BIT(4))
#define SLC_FRHOST_BIT4_INT_RAW_M  (BIT(4))
#define SLC_FRHOST_BIT4_INT_RAW_V  0x1
#define SLC_FRHOST_BIT4_INT_RAW_S  4
/* SLC_FRHOST_BIT3_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT3_INT_RAW  (BIT(3))
#define SLC_FRHOST_BIT3_INT_RAW_M  (BIT(3))
#define SLC_FRHOST_BIT3_INT_RAW_V  0x1
#define SLC_FRHOST_BIT3_INT_RAW_S  3
/* SLC_FRHOST_BIT2_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT2_INT_RAW  (BIT(2))
#define SLC_FRHOST_BIT2_INT_RAW_M  (BIT(2))
#define SLC_FRHOST_BIT2_INT_RAW_V  0x1
#define SLC_FRHOST_BIT2_INT_RAW_S  2
/* SLC_FRHOST_BIT1_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT1_INT_RAW  (BIT(1))
#define SLC_FRHOST_BIT1_INT_RAW_M  (BIT(1))
#define SLC_FRHOST_BIT1_INT_RAW_V  0x1
#define SLC_FRHOST_BIT1_INT_RAW_S  1
/* SLC_FRHOST_BIT0_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT0_INT_RAW  (BIT(0))
#define SLC_FRHOST_BIT0_INT_RAW_M  (BIT(0))
#define SLC_FRHOST_BIT0_INT_RAW_V  0x1
#define SLC_FRHOST_BIT0_INT_RAW_S  0

#define SLC_0INT_ST_REG          (DR_REG_SLC_BASE + 0x8)
/* SLC_SLC0_HOST_POP_EOF_ERR_INT_ST : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST_M  (BIT(27))
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST_V  0x1
#define SLC_SLC0_HOST_POP_EOF_ERR_INT_ST_S  27
/* SLC_SLC0_RX_QUICK_EOF_INT_ST : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_QUICK_EOF_INT_ST  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ST_M  (BIT(26))
#define SLC_SLC0_RX_QUICK_EOF_INT_ST_V  0x1
#define SLC_SLC0_RX_QUICK_EOF_INT_ST_S  26
/* SLC_CMD_DTC_INT_ST : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define SLC_CMD_DTC_INT_ST  (BIT(25))
#define SLC_CMD_DTC_INT_ST_M  (BIT(25))
#define SLC_CMD_DTC_INT_ST_V  0x1
#define SLC_CMD_DTC_INT_ST_S  25
/* SLC_SLC0_TX_ERR_EOF_INT_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_ERR_EOF_INT_ST  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ST_M  (BIT(24))
#define SLC_SLC0_TX_ERR_EOF_INT_ST_V  0x1
#define SLC_SLC0_TX_ERR_EOF_INT_ST_S  24
/* SLC_SLC0_WR_RETRY_DONE_INT_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_WR_RETRY_DONE_INT_ST  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ST_M  (BIT(23))
#define SLC_SLC0_WR_RETRY_DONE_INT_ST_V  0x1
#define SLC_SLC0_WR_RETRY_DONE_INT_ST_S  23
/* SLC_SLC0_HOST_RD_ACK_INT_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_HOST_RD_ACK_INT_ST  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ST_M  (BIT(22))
#define SLC_SLC0_HOST_RD_ACK_INT_ST_V  0x1
#define SLC_SLC0_HOST_RD_ACK_INT_ST_S  22
/* SLC_SLC0_TX_DSCR_EMPTY_INT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST_M  (BIT(21))
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST_V  0x1
#define SLC_SLC0_TX_DSCR_EMPTY_INT_ST_S  21
/* SLC_SLC0_RX_DSCR_ERR_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_DSCR_ERR_INT_ST  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ST_M  (BIT(20))
#define SLC_SLC0_RX_DSCR_ERR_INT_ST_V  0x1
#define SLC_SLC0_RX_DSCR_ERR_INT_ST_S  20
/* SLC_SLC0_TX_DSCR_ERR_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DSCR_ERR_INT_ST  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ST_M  (BIT(19))
#define SLC_SLC0_TX_DSCR_ERR_INT_ST_V  0x1
#define SLC_SLC0_TX_DSCR_ERR_INT_ST_S  19
/* SLC_SLC0_TOHOST_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOHOST_INT_ST  (BIT(18))
#define SLC_SLC0_TOHOST_INT_ST_M  (BIT(18))
#define SLC_SLC0_TOHOST_INT_ST_V  0x1
#define SLC_SLC0_TOHOST_INT_ST_S  18
/* SLC_SLC0_RX_EOF_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_EOF_INT_ST  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ST_M  (BIT(17))
#define SLC_SLC0_RX_EOF_INT_ST_V  0x1
#define SLC_SLC0_RX_EOF_INT_ST_S  17
/* SLC_SLC0_RX_DONE_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_DONE_INT_ST  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ST_M  (BIT(16))
#define SLC_SLC0_RX_DONE_INT_ST_V  0x1
#define SLC_SLC0_RX_DONE_INT_ST_S  16
/* SLC_SLC0_TX_SUC_EOF_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_SUC_EOF_INT_ST  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ST_M  (BIT(15))
#define SLC_SLC0_TX_SUC_EOF_INT_ST_V  0x1
#define SLC_SLC0_TX_SUC_EOF_INT_ST_S  15
/* SLC_SLC0_TX_DONE_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_DONE_INT_ST  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ST_M  (BIT(14))
#define SLC_SLC0_TX_DONE_INT_ST_V  0x1
#define SLC_SLC0_TX_DONE_INT_ST_S  14
/* SLC_SLC0_TOKEN1_1TO0_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN1_1TO0_INT_ST  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ST_M  (BIT(13))
#define SLC_SLC0_TOKEN1_1TO0_INT_ST_V  0x1
#define SLC_SLC0_TOKEN1_1TO0_INT_ST_S  13
/* SLC_SLC0_TOKEN0_1TO0_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN0_1TO0_INT_ST  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ST_M  (BIT(12))
#define SLC_SLC0_TOKEN0_1TO0_INT_ST_V  0x1
#define SLC_SLC0_TOKEN0_1TO0_INT_ST_S  12
/* SLC_SLC0_TX_OVF_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_OVF_INT_ST  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ST_M  (BIT(11))
#define SLC_SLC0_TX_OVF_INT_ST_V  0x1
#define SLC_SLC0_TX_OVF_INT_ST_S  11
/* SLC_SLC0_RX_UDF_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_UDF_INT_ST  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ST_M  (BIT(10))
#define SLC_SLC0_RX_UDF_INT_ST_V  0x1
#define SLC_SLC0_RX_UDF_INT_ST_S  10
/* SLC_SLC0_TX_START_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_START_INT_ST  (BIT(9))
#define SLC_SLC0_TX_START_INT_ST_M  (BIT(9))
#define SLC_SLC0_TX_START_INT_ST_V  0x1
#define SLC_SLC0_TX_START_INT_ST_S  9
/* SLC_SLC0_RX_START_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_START_INT_ST  (BIT(8))
#define SLC_SLC0_RX_START_INT_ST_M  (BIT(8))
#define SLC_SLC0_RX_START_INT_ST_V  0x1
#define SLC_SLC0_RX_START_INT_ST_S  8
/* SLC_FRHOST_BIT7_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT7_INT_ST  (BIT(7))
#define SLC_FRHOST_BIT7_INT_ST_M  (BIT(7))
#define SLC_FRHOST_BIT7_INT_ST_V  0x1
#define SLC_FRHOST_BIT7_INT_ST_S  7
/* SLC_FRHOST_BIT6_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT6_INT_ST  (BIT(6))
#define SLC_FRHOST_BIT6_INT_ST_M  (BIT(6))
#define SLC_FRHOST_BIT6_INT_ST_V  0x1
#define SLC_FRHOST_BIT6_INT_ST_S  6
/* SLC_FRHOST_BIT5_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT5_INT_ST  (BIT(5))
#define SLC_FRHOST_BIT5_INT_ST_M  (BIT(5))
#define SLC_FRHOST_BIT5_INT_ST_V  0x1
#define SLC_FRHOST_BIT5_INT_ST_S  5
/* SLC_FRHOST_BIT4_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT4_INT_ST  (BIT(4))
#define SLC_FRHOST_BIT4_INT_ST_M  (BIT(4))
#define SLC_FRHOST_BIT4_INT_ST_V  0x1
#define SLC_FRHOST_BIT4_INT_ST_S  4
/* SLC_FRHOST_BIT3_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT3_INT_ST  (BIT(3))
#define SLC_FRHOST_BIT3_INT_ST_M  (BIT(3))
#define SLC_FRHOST_BIT3_INT_ST_V  0x1
#define SLC_FRHOST_BIT3_INT_ST_S  3
/* SLC_FRHOST_BIT2_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT2_INT_ST  (BIT(2))
#define SLC_FRHOST_BIT2_INT_ST_M  (BIT(2))
#define SLC_FRHOST_BIT2_INT_ST_V  0x1
#define SLC_FRHOST_BIT2_INT_ST_S  2
/* SLC_FRHOST_BIT1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT1_INT_ST  (BIT(1))
#define SLC_FRHOST_BIT1_INT_ST_M  (BIT(1))
#define SLC_FRHOST_BIT1_INT_ST_V  0x1
#define SLC_FRHOST_BIT1_INT_ST_S  1
/* SLC_FRHOST_BIT0_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT0_INT_ST  (BIT(0))
#define SLC_FRHOST_BIT0_INT_ST_M  (BIT(0))
#define SLC_FRHOST_BIT0_INT_ST_V  0x1
#define SLC_FRHOST_BIT0_INT_ST_S  0

